[
	{
		"id": "techivation",
		"companyName": "Techivation Ltd",
		"dateRange": "September 2021 - December 2023",
		"role": "IT Specialist & Lead Developer",
		"description": "As a Lead Developer, I navigated a challenging and thrilling journey, guiding the creation and perfection of both the website and API for an eCommerce platform of a UK-based company specializing in the sale of audio software products.",
		"images": [
			"techivation-1.png",
			"techivation-2.png",
			"techivation-3.png",
			"techivation-4.png",
			"techivation-5.png",
			"techivation-6.png",
			"techivation-7.png",
			"techivation-8.png",
			"techivation-9.png"
		],
		"buttons": [
			{
				"link": "https://techivation.com",
				"label": "Visit website"
			}
		],
		"achievements": [
			{
				"title": "Designed and Implemented Robust API & Database",
				"description": "Engineered a scalable API and database architecture, ensuring seamless communication between front-end and back-end components, resulting in improved system reliability and performance."
			},
			{
				"title": "Innovative A/B Audio Player Development",
				"description": "Designed and built a custom interactive A/B audio player, enhancing user engagement and providing a unique and immersive audio experience."
			},
			{
				"title": "Developed Intuitive Admin Dashboards",
				"description": "Architected and implemented a user-friendly admin dashboard, providing an efficient interface for administrators to manage and monitor key aspects of the system."
			},
			{
				"title": "Active Involvement in Decision-Making",
				"description": "Contributed significantly to strategic decision-making processes, providing valuable input on technology choices, feature prioritization, and overall project direction."
			},
			{
				"title": "Optimized website SEO and Performance",
				"description": "Made SEO improvements and speed optimizations, leading to better search rankings and faster, smoother user experience."
			},
			{
				"title": "Effective Team Management and Leadership",
				"description": "Managed and led a team of developers, promoting a collaborative and productive work environment, resulting in successful project delivery and the achievement of team goals."
			},
			{
				"title": "Integrated Payment Gateways for Seamless Transactions",
				"description": "Successfully integrated and configured payment processing systems, including Stripe and PayPal, ensuring secure and efficient online transactions for enhanced user experience."
			},
			{
				"title": "Contributed to Page Design and Aesthetics",
				"description": "Played a key role in the design process, contributing creative insights and collaborating with design teams to create visually appealing and user-friendly web pages."
			}
		]
	},
	{
		"id": "solidersound",
		"companyName": "SoliderSound Ltd",
		"dateRange": "April 2023 - December 2023",
		"role": "Lead Developer",
		"description": "Played a key role in the development and administration of an eCommerce website for a company focused on audio plugins development.",
		"images": [
			"solidersound-1.png",
			"solidersound-2.png",
			"solidersound-3.png",
			"solidersound-4.png",
			"solidersound-5.png",
			"solidersound-6.png",
			"solidersound-7.png"
		],
		"buttons": [
			{
				"link": "https://solidersound.com",
				"label": "Visit website"
			}
		],
		"achievements": [
			{
				"title": "Led the Development of an eCommerce Website and System",
				"description": "Directed the end-to-end development of a comprehensive eCommerce website and system, including secure payment processing, inventory management, and a user-friendly shopping experience."
			},
			{
				"title": "Effectively Managed and Led Development Teams",
				"description": "Showed effective leadership by managing a team of developers, encouraging collaboration for successful project completion."
			},
			{
				"title": "Provided Input in Decision-Making Processes",
				"description": "Played a key role in strategic decision-making, contributing insights on technology choices, feature prioritization, and guiding the overall direction of projects."
			},
			{
				"title": "Architected and Implemented API & Database",
				"description": "Designed and implemented a robust API and database infrastructure, ensuring seamless communication between front-end and back-end systems."
			},
			{
				"title": "Implemented strategic SEO enhancements and performance optimizations",
				"description": "Applied targeted SEO enhancements and performance improvements, leading to higher search rankings and enhanced user experience speed and responsiveness."
			},
			{
				"title": "Successfully integrated and configured Stripe and PayPal payment processing",
				"description": "Efficiently integrated Stripe and PayPal payment systems, ensuring secure and seamless online transactions for an enhanced user experience."
			}
		]
	},
	{
		"id": "brenco",
		"companyName": "BRENCO Engineering & Consulting",
		"dateRange": "August 2021 - February 2022",
		"role": "Full Stack Developer",
		"description": "In my initial role as a Full-time Full Stack Developer within a prominent tech company, I took on the challenge of overseeing multiple projects concurrently, collaborating closely with a skilled team of managers, designers and developers.",
		"images": [
	
		],
		"buttons": [],
		"achievements": [
			{
				"title": "Collaborated with Cross-Functional Teams on Diverse Projects",
				"description": "Played an integral role in cross-functional teams, fostering collaboration and synergy to deliver successful projects."
			},
			{
				"title": "Managed IoT API Infrastructure for Seamless Integration",
				"description": "Oversaw the management and optimization of IoT API systems, ensuring seamless integration and communication between devices and platforms."
			},
			{
				"title": "Transformed Standard Websites into React-Based Interactive Platforms",
				"description": "Led the conversion of multiple websites into React-based interactive platforms, enhancing user engagement and modernizing the user experience."
			},
			{
				"title": "Developed and Deployed Server Monitoring Systems",
				"description": "Guided the implementation of robust server monitoring systems, ensuring optimal performance and reliability."
			},
			{
				"title": "Partnered with Incubated Startups to Create Customized Websites",
				"description": "Collaborated closely with incubated startups to design and develop personalized websites, aligning with their unique visions and goals."
			},
			{
				"title": "Contributed to Developers Recruitment and Onboarding",
				"description": "Played a pivotal role in the recruitment process, identifying top talent and supporting the seamless onboarding of new developers into the team."
			}
		]
	},
	{
		"id": "freelancing",
		"companyName": "Freelancing / Personal Projects",
		"dateRange": "Before August 2021",
		"role": "Freelance Web Developer",
		"description": "During an intensive 8-month period, I actively applied the range of technologies I had learned to a variety of projects. These included both personal endeavors and freelance work, offering me practical experience in real-world settings.",
		"images": [
			"freelancing-1.png",
			"freelancing-2.png",
			"freelancing-3.png",
			"freelancing-4.png",
			"freelancing-5.png",
			"freelancing-6.png",
			"freelancing-7.png"
		],
		"buttons": [
			{
				"link": "https://old.nas.codes",
				"label": "Visit old portfolio"
			}
		],
		"achievements": [
			{
				"title": "Contributed to Freelance Projects, Providing Custom Solutions",
				"description": "Successfully completed various freelance projects, leveraging expertise to deliver customized solutions that met the unique needs and requirements of clients."
			},
			{
				"title": "Studied and practiced making Shopify themes.",
				"description": "Gained proficiency in crafting Shopify themes through focused study and hands-on practice. By immersing myself in theme design and customization, I developed the skills to create tailored solutions for diverse client needs."
			},
			{
				"title": "Refined Front-End Development skills through personal projects.",
				"description": "Created several websites emphasizing front-end design and functionality, enhancing user experience and interface aesthetics."
			},
			{
				"title": "Architected a React Chat Application",
				"description": "Designed and developed a React-based chat application, showcasing mastery of modern web development frameworks and technologies, while providing users with an intuitive communication platform."
			},
			{
				"title": "Crafted an Employees Management Software as part of Computer Science School Thesis",
				"description": "Conceptualized and developed a robust employees management software as a crucial component of my Computer Science thesis, showcasing advanced technical skills and problem-solving abilities."
			},
			{
				"title": "Engineered a Patient Management Software for a Local Medical Center",
				"description": "Led the development of a comprehensive software solution adapted to optimize patient management processes, enhancing efficiency and organization within the medical center."
			}
		]
	}
]